{
    "home": {
        "header": "Find your path in your new life. We'll help you step by step."
    },
    "your_path": {
        "home": "Home",
        "tips_and_tricks": "Tips & tricks",
        "next_steps": "Next steps",
        "further_resources": "Further resources (free of charge, reputable)",
        "main": {
            "title": "Welcome to Pathways",
            "description": "This guide will help you navigate your options in Germany. Whether you want to earn money, continue your education, or learn German, we have resources and step-by-step guidance for you. Choose the path that best fits your current situation and goals.",
            "tips": {
                "explore_multiple_paths": "You can explore multiple paths - they are not mutually exclusive",
                "paths_complement_eachother": "Many paths complement each other (e.g., learning German while working)",
                "take_your_time": "Take your time to read through each option before deciding"
            },
            "steps": {
                "earn_money": "Earn Money – Work & Career",
                "get_school_certificate": "Get / Upgrade a School Certificate",
                "learn_german": "Learn German"
            }
        },
        "earn_money": {
            "title": "Earn Money – Work & Career",
            "description": "You want to earn money or gain your first work experience, but you are not yet sure which profession suits you? Here you will find pathways into work and careers – even without a perfect school certificate or with limited German skills. Whether it is a job, apprenticeship, internship or voluntary service: there are more options than you might think. We show you where to start and which steps make sense.",
            "tips": {
                "no_need_for_plan": "You do not need a perfect plan right away. Many paths begin with trying things out.",
                "practical_experience": "Practical experience often matters more than certificates, especially at the beginning.",
                "german_skills": "German language skills improve significantly through work and practical experience.",
                "low_age_opportunity": "Even at the age of 16 or 17, there are legal opportunities to work or prepare for a career.",
                "jobs_at_mecklenburg": "In Mecklenburg-Vorpommern, there are many entry-level jobs in: Skilled trades / crafts, Health care & social services, Gastronomy & tourism, Logistics & warehousing, Rural regions often offer more opportunities because skilled workers are needed.",
                "without_contract": "Be careful with offers without a contract or with cash payment.",
                "private_offers": "Always check private offers to see whether costs apply.",
                "if_unsure": "If you are unsure: get advice first (e.g. Jobcenter, Youth Employment Agency). Counselling is free – use it!"
            },
            "links": {
                "check-u": "Check-U (Federal Employment Agency) → free interests and strengths test",
                "berufe_tv": "BerufeTV → videos about professions (also suitable for weaker German skills)",
                "federal_employment_agency": "Job portal of the Federal Employment Agency",
                "ausbildung": "Ausbildung.de",
                "meinestadt": "meinestadt.de (especially useful regionally in MV)",
                "jba": "Youth Employment Agency (JBA)",
                "migration_councelling": "Migration counselling for young people (MBE / JMD)"
            },
            "steps": {
                "no_idea": "I have no idea. What profession? What training?",
                "have_idea": "I have a wish/ an idea about what I`d like to do"
            }
        },
        "no_idea": {
            "title": "I have no idea: What profession? What training?",
            "description": "This is the case for a lot of people—don't panic. Here you can find out: - what options are available - what might suit you - how to learn a profession - where to find support and advice. Even at 16 or 17, there are legal ways to work or prepare for a career. Just click on. You can try out different paths (e.g., internships or vocational preparation) – you can always decide later. There are no wrong answers here; the important thing is that you get started. Let's see which path suits you best.",
            "tips": {
                "job_centers_advice": "Advice from job centers, employment agencies, and youth career agencies is free—take advantage of it!",
                "career_guidance_websites": "Career guidance websites are very easy to understand and informative—watch VIDEOS about different professions and take tests.",
                "several_tests": "Take SEVERAL tests for guidance—a single test is almost never perfect. Which professions are suggested most often?",
                "trial_and_error": "Many paths begin with trial and error. Practical experience often counts for more than certificates, especially at the beginning.",
                "check_costs_involved": "When it comes to private counseling and placement services, always check first whether there are any costs involved.",
                "be_wary_jobs": "Be wary of job offers without a contract or with cash payments.",
                "use_chatgpt": "💡 Tip:\nIf you are unsure or don't understand something, you can use digital aids such as AI (e.g., ChatGPT):\n– to get directions explained to you\n– to describe professions\n– to practice applications or texts\n– to ask questions that you would otherwise not dare to ask."
            },
            "links": {
                "orientation_careers": "Orientation: Career fields are presented, with many references across the topic",
                "check_u": "Orientation: Check-U (Employment Agency) Career orientation & entry → free interest and strengths test",
                "arbeits_agentur": "Orientation: Finding the right career, entry → free interest and strengths test",
                "jugend_berufs_agentur": "Counseling: Youth Career Agency (JBA)",
                "jobcenter_digital": "Counseling: Job center / Employment Agency",
                "jmd4you": "Counseling at the Youth Migration Service: jmd4YOU - Counseling portal for your life in Germany",
                "arbeits_agentur_students": "Career counseling for students What does the Employment Agency's career counseling service do? Is career counseling useful? When is the right time for it?",
                "berufe_tv": "Career videos — you can see real workplaces",
                "azubi_de": "Job descriptions with tasks, salary, and requirements",
                "berufe_net": "Detailed information on almost every profession (for advanced learners)",
                "planet_beruf": "Very good, simple explanations of apprenticeship professions (also for those with weaker German skills)"
            },
            "steps": {
                "what_workers_demand": "What kind of workers are in demand in MV?",
                "ask_your_school": "Ask your school, job center, or career counselor about internship opportunities.",
                "find_which_occupation": "Find out for yourself which occupations are in short supply in your region. Use AI: “Which occupations are in demand and have a future in MV?",
                "orientation_test": "Take a career orientation test. Compare the demand with your interests. ",
                "search_for_companies": "Search for companies in your area yourself and ask about internships. Use AI to write an inquiry email or resume."
            }
        },
        "demand_in_mv": {
            "title": "Which professions are in demand in MV?",
            "description": "Where you live makes a difference. Every region needs different professions. This gives you opportunities—even without perfect school grades. In Mecklenburg-Western Pomerania, practical professions are particularly sought after: e.g., skilled trades, nursing, gastronomy, or logistics. Here you can find out which professions are really needed in your area and where you can get an apprenticeship, internship, or entry-level position more quickly. You don't have to commit 'forever.' First look, try things out, gain experience → then decide.",
            "tips": {
                "entry_level_sectors": "In Mecklenburg-Vorpommern, there are many entry-level jobs in: Skilled trades / crafts, Health care & social services, Gastronomy & tourism, Logistics & warehousing.",
                "rural_opportunities": "Rural areas sometimes even offer more chances - because there is a lack of skillful workers."
            },
            "links": {
                "discover_tests": "Discover lots of different tests on career choices, study choices, self-perception and external perception, strengths, and interests",
                "job_exchange": "Job exchange of the Federal Employment Agency",
                "meinestadt": "Find everything within your zip code area—even jobs",
                "check_u_alt": "Orientation: Check-U (Employment Agency) Career orientation & entry → free interest and strengths test"
            },
            "steps": {
                "bop_internship": "Vocational orientation internship (BOP)",
                "bvj_year": "Vocational preparation year (BVJ)",
                "bvj_s_language": "Vocational preparation year LANGUAGE (BVJ-S)",
                "pre_vocational_prog": "Pre-Vocational Preparation Program",
                "entry_qualification": "Entry-level qualification",
                "dual_pre_vocational": "(Dual) Pre-Vocational Training"
            }
        },
        "bop_internship": {
            "title": "Career Exploration Internship (BOP)",
            "description": "A short internship to try out a profession. You spend a few weeks in a company to see if the job fits you. You gain practical experience in a company and receive support from the Employment Agency or Job Center.",
            "tips": {
                "duration": "The internship lasts between 1 and 6 weeks. It can be extended to a maximum of 6 weeks.",
                "free_of_charge": "Participation in the career orientation internship is free of charge.",
                "remuneration_travel": "As a rule, no remuneration is paid. BUT: Travel or accommodation costs can be covered if necessary. Apply to the Jobcenter or Employment Agency to have your costs covered!",
                "prerequisite": "The prerequisite is that compulsory schooling has been completed and you are not currently attending school.",
                "important_job_center": "⚠️ Important: ALWAYS get the job center involved beforehand: They can check and decide what help you can get! That's why the internship can only start after approval by the job center or employment agency."
            },
            "links": {
                "fed_agency_bop": "Federal Employment Agency - Career Orientation Internship",
                "vplt_info": "VPLT info folders"
            },
            "steps": {
                "consultation_appointment": "Arrange a consultation appointment",
                "consultation_interview": "Conduct a consultation interview",
                "find_company": "Find a company for the internship",
                "apply_bop": "Apply for a vocational orientation internship",
                "wait_approval": "Wait for approval",
                "search_vacancies_dual": "Search for vacancies for (Dual) Pre-Vocational Training"
            }
        },
        "bvj_program": {
            "title": "Pre-Vocational School Program (BVJ)",
            "description": "The Vocational Preparation Year (BVJ) is a one-year school programme for young people who do not yet have an apprenticeship or a clear career perspective. It combines lessons at a vocational school with practical work experience in companies. For young people who have recently migrated and have limited German skills, there is a specialised language-focused version called BVJ-S. The exact rules may vary slightly depending on the federal state.",
            "tips": {
                "daz_focus": "German as a Second Language (DaZ) is the central focus of the programme. Ask specifically about intensive DaZ lessons if your German level is still low.",
                "language_practice_mix": "Language learning and practical experience are well combined in BVJ-S, helping you improve your vocabulary in a work environment.",
                "attendance_compulsory": "Regular attendance is important – BVJ-S is subject to compulsory schooling for young people.",
                "early_start": "Starting early pays off – better German makes everyday life and your future training much easier.",
                "parents_involvement": "Parents or guardians should be involved early in the process to support your planning."
            },
            "links": {
                "ba_info": "Information from the Federal Employment Agency on career guidance and BVJ",
                "ausbildung_de_bvj": "BVJ: Your springboard into vocational training",
                "ausbildungspark_abc": "The ABCs of training: Vocational preparation year (BVJ)",
                "kmk_education": "Conference of Ministers of Education and Cultural Affairs – School education info",
                "dqr_certificate": "Information about BVJ leaving certificates and their equivalence",
                "videos_bvj": "Watch videos about the Vocational Preparation Year (BVJ)"
            },
            "steps": {
                "contact_schools_mv": "Contact vocational schools in Mecklenburg-Western Pomerania and ask if they offer BVJ-S.",
                "check_regional_options": "Check which vocational school in your region offers BVJ-S.",
                "prepare_documents": "Prepare application documents (last school report, possibly a CV). Use AI for help!",
                "plan_internships": "Plan internships and additional language practice early."
            }
        },
        "bvj_s_program": {
            "title": "Pre-Vocational School Program with Language Focus (BVJ-S)",
            "description": "The Vocational Preparation Year with Language Focus (BVJ-S) is a school-based programme at vocational schools in Germany designed specifically for newly arrived young people with limited German language skills. Its main goal is to improve German language skills and support career orientation. The programme combines intensive German as a second language (DaZ) lessons with practical activities. It usually lasts one school year and prepares you for the next steps, such as vocational training or further schooling.",
            "tips": {
                "helpful_for_limited_german": "Especially helpful if German skills are not yet sufficient for vocational training.",
                "internships_orientation": "Internships help with career orientation and improve everyday language skills simultaneously."
            },
            "links": {
                "mv_schools_overview": "Overview of vocational schools in Mecklenburg-Western Pomerania",
                "mv_education_server": "Education server of MV – Information on vocational preparation programmes",
                "ba_vocational_schools": "Information from the Employment Agency about vocational schools",
                "vhs_portal": "Free online German courses (A1–B2) provided by adult education centres",
                "dw_learn_german": "Free German-learning resources by Deutsche Welle",
                "goethe_practice": "Free German practice materials from the Goethe-Institut"
            },
            "steps": {
                "ask_entry_dates": "Ask about entry dates – mid-year entry may be possible.",
                "contact_social_workers": "Use counselling services from youth career agencies or school social workers."
            }
        },
        "bvb_program": {
            "title": "Career Preparation Program (BvB)",
            "description": "The Vocational Preparation Programme (BvB) is an offer provided by the Federal Employment Agency for young people under the age of 25. It supports career orientation, preparation for vocational training or direct entry into work. The programme is carried out by certified training providers and can also include the opportunity to obtain a lower secondary school certificate.",
            "tips": {
                "no_plan_suitable": "Suitable if you do not yet have an apprenticeship or clear career plan.",
                "no_certificate_ok": "Possible even without a school certificate.",
                "learning_practice_mix": "Combines learning, practice and career orientation.",
                "several_internships": "Several internships help you try out different professions.",
                "obtain_certificate": "A school certificate can often be obtained during the programme.",
                "flexible_adapted": "The programme is flexible and adapted to individual needs."
            },
            "links": {
                "official_ba_info": "Official information from the Federal Employment Agency about the BvB programme",
                "local_agency": "Find your local Employment Agency (also valid for Mecklenburg-Vorpommern)"
            },
            "steps": {
                "make_appointment": "Make an appointment with the Employment Agency",
                "attend_counselling": "Attend a career counselling session",
                "check_suitability": "Check whether BVB is suitable for you",
                "get_assigned": "Get assigned to a certified training provider",
                "apply_bvb": "Apply for the programme through the Employment Agency",
                "use_internships": "Actively use internships and career guidance"
            }
        },
        "eq_internship": {
            "title": "Pre-Apprenticeship Internship (EQ)",
            "description": "Pre-Apprenticeship Internship (EQ) is a programme run by the Employment Agency and works like an extended internship in a company (6–12 months). You work like a trainee and often get an apprenticeship afterwards.",
            "tips": {
                "duration": "An entry qualification lasts at least 4 months and up to a maximum of 12 months.",
                "transition": "A transition into an apprenticeship is possible at any time.",
                "time_model": "The EQ usually takes place full-time, but can also be completed part-time if needed.",
                "prerequisite": "Participation is only possible if you have not yet completed a vocational qualification or a degree.",
                "school_mandatory": "If you are subject to compulsory vocational school attendance, attending vocational school remains mandatory.",
                "allowance": "During the EQ, you receive a monthly allowance of €276 funded by the Employment Agency.",
                "costs": "Travel costs may be covered; the company may voluntarily top up the allowance.",
                "company_based_only": "⚠️ Important: Entry qualifications are only possible for company-based training, not for school-based vocational training."
            },
            "links": {
                "employment_agency": "Employment Agency – Entry Qualification",
                "ihk": "Chamber of Industry and Commerce – Entry qualification",
                "videos": "VIDEOS on entry qualifications"
            },
            "steps": {
                "check_reqs": "Check whether you meet the requirements",
                "find_company": "Find a company for the entry qualification",
                "apply": "Apply for entry qualification"
            }
        },
        "dual_apprenticeship": {
            "title": "Apprenticeship (Dual System)",
            "description": "In the dual system, you work in a company and attend a vocational school at the same time. You earn money while learning a profession from scratch. It usually lasts 3 to 3.5 years. You receive a trainee salary (Ausbildungsvergütung) that increases each year.",
            "tips": {
                "german_level": "You don't have to speak perfect German to start; many companies support you if you show commitment.",
                "motivation_over_grades": "Many employers value motivation, reliability, and practical interest more than perfect school grades.",
                "internships_impact": "Previous internships or entry-level qualifications (EQ) significantly increase your chances of getting a contract.",
                "application_help": "Don't do it alone – get help with your resume from job centers or school counseling services.",
                "labor_shortage": "Look for 'shortage occupations' (Mangelberufe) – the chances for an apprenticeship are particularly high there.",
                "take_your_time": "Take your time to find out which profession really suits your talents.",
                "parallel_channels": "Use multiple channels: online portals, apprenticeship exchanges, and direct contact with local companies.",
                "networking": "Networking pays off – talk to family, friends, and teachers about your plans.",
                "training_fairs": "Visit training fairs (Ausbildungsmessen) to talk directly to potential employers."
            },
            "links": {
                "ihk_platform": "My training in Germany (IHK platform)",
                "mv_market": "Training market in Mecklenburg-Western Pomerania",
                "mv_positions": "Current training positions in MV",
                "mv_azubi_de": "Apprenticeship exchange for Mecklenburg-Western Pomerania",
                "resume_templates_1": "Resume: Professional tips and templates",
                "resume_templates_2": "Resume: Modern templates and designs",
                "cover_letter_templates": "Cover letter: Tips and templates for apprenticeships"
            },
            "steps": {
                "full_time_job": "I want a full-time job now",
                "interest_check": "Think about it: Which professional fields interest me? (Crafts, nursing, tech?)",
                "search_online": "Search for apprenticeships online or regionally",
                "apply_multiple": "Apply to several companies at the same time",
                "create_resume": "Create a clear, tabular resume",
                "write_application": "Write your first application (it doesn't have to be perfect!)"
            }
        },
        "school_certificate": {
            "title": "School Certificate (Catch up / Upgrade)",
            "description": "You do not yet have a school certificate or would like to achieve a higher qualification? In Germany, there are many ways to catch up on or improve a school certificate – even if you had to leave school, are new to Germany or are still learning German. Here you will find an overview of the most important pathways and support options.",
            "tips": {
                "obtain_after_compulsory": "A school certificate can also be obtained after compulsory schooling has ended.",
                "advice_saves_time": "Getting advice before you start saves time and helps avoid detours.",
                "language_improvement": "German language skills can be improved alongside completing a school certificate.",
                "free_programmes": "Many programmes are free of charge or publicly funded.",
                "several_pathways": "It is normal to consider several pathways before making a decision."
            },
            "links": {
                "ba_school_advice": "Employment Agency – School Qualifications & Advice",
                "jba_advice": "Youth Employment Agency (JBA) - personal advice for young people up to age 25",
                "vhs_main": "Adult Education Center (VHS) – Germany-wide search for courses",
                "vhs_finder": "VHS Course Finder (Filter by location)",
                "mv_educational_counseling": "School Authority / Educational Counseling in MV",
                "mv_school_types": "Regional schools, qualifications and pathways in MV",
                "jmd_service": "JMD (Youth Migration Service) - Personal advice for 12-27 year olds",
                "jmd4you_portal": "Online advice portal (jmd4YOU) – available in Russian/Ukrainian",
                "mbeon_app": "MBE (Migration Counseling for Adults) – App counseling and chat"
            },
            "steps": {
                "vocational_qual": "Catching up on vocational qualifications (Berufsreife, Hauptschulabschluss)",
                "intermediate_qual": "Catching up on intermediate qualifications (Mittlere Reife, Realschulabschluss)",
                "abitur": "Abitur / university entrance qualification",
                "ukrainian_qual": "Information on Ukrainian school qualification equivalence",
                "bvj_pathway": "BVJ (vocational preparation year) – useful if you are still unsure",
                "evening_school": "Evening school / adult education center",
                "distance_learning": "Distance learning / distance education",
                "external_exam": "External examination / non-school examination",
                "check_form": "Check which form (evening school, distance learning, external studies) suits you best"
            }
        },
        "lower_secondary_certificate": {
            "title": "Lower secondary school certificate (Berufsreife)",
            "description": "The 'Regionale Schule' is not a separate school type—the final certificate depends on your performance. The basic school certificate (Berufsreife) is an officially recognised German school qualification after grade 9. It is usually the minimum requirement to start vocational training (Ausbildung).",
            "tips": {
                "not_immediate": "You don't have to finish your school certificate immediately. Many people first start with a vocational preparation year (BVJ), an internship, or a job — and complete the certificate later.",
                "get_later": "If you didn't finish school, that's not a problem. In Germany you can still get a school certificate later — in several ways: BVJ, vocational school, evening school, external exams.",
                "ukraine_recognition": "If you already have a Ukrainian school certificate, it can often be officially recognised."
            },
            "links": {
                "vhs_mv": "VHS Mecklenburg-Vorpommern: Courses and preparation programmes to obtain a school certificate as an adult",
                "recognition_mv": "Recognition of foreign school certificates (MV): Official state authority that checks whether your Ukrainian school certificate is equivalent to a German one"
            },
            "steps": {
                "photo_certificate": "First, take a photo of your latest school certificate (Ukrainian is fine).",
                "make_appointment": "Ask your school, Jobcenter or Youth Employment Agency (JBA) for an appointment — you don't need to prepare anything.",
                "check_equivalence": "They will check which German qualification your certificate equals.",
                "no_certificate_query": "If you have no certificate: ask about BVJ or vocational schools.",
                "decide_pathway": "Decide what fits you better: daily school (BVJ) or flexible learning (evening school / distance learning).",
                "use_ai_tools": "Use learning websites or AI tools to practise and understand school topics.",
                "financial_support": "Ask if you can get financial support."
            }
        },
        "intermediate_certificate": {
            "title": "Intermediate secondary school certificate",
            "description": "The Intermediate secondary school certificate (formerly Realschulabschluss) is a medium-level school qualification in Germany. In Mecklenburg-Vorpommern it is usually completed after grade 10 at a Regional School or a comprehensive school. With this certificate you can: start a vocational training (apprenticeship), attend further vocational schools and, with good grades, later continue to the Abitur (university entrance qualification).",
            "tips": {
                "performance_decides": "A \"Regional School\" is not a special school type — your performance decides the certificate you get.",
                "attendance_matters": "If you are still in school: attendance and participation matter a lot.",
                "key_subjects": "Focus especially on German, Maths and English — they are key subjects in the final exams.",
                "ukraine_recognition": "If you already have a Ukrainian school certificate, it may be officially recognised in Germany.",
                "parallel_learning": "You do not have to do everything at once — language learning and school qualification can run in parallel."
            },
            "links": {
                "mv_education_info": "Ministry of Education Mecklenburg-Vorpommern — Information on catching up school qualifications"
            },
            "steps": {
                "recognize_certificate": "Have your Ukrainian school certificate officially recognised (if you have one).",
                "contact_vhs": "Contact a local Adult Education Centre (VHS) for courses and preparation classes.",
                "evening_distance_option": "Consider evening school or distance learning if you need to work during the day.",
                "learning_schedule": "Create a realistic learning schedule (German, Maths, English)."
            }
        },
        "remote_school": {
            "title": "Remote secondary school",
            "description": "Distance learning means you study from home at your own pace. You receive materials online or by mail and have access to tutors for support. This is a great option if you need to work, care for family, or live far from a physical school. Important: Unlike public adult education centers, distance learning usually involves fees, but you can often get financial support.",
            "tips": {
                "compare_schools": "Compare several schools before choosing one (check price, support, and reviews).",
                "former_students": "Read experiences from former students to see how they managed their studies.",
                "fixed_study_times": "Set fixed study times — otherwise it is very easy to keep postponing your work.",
                "contact_tutors": "Always contact your tutors or teachers if you do not understand something.",
                "quiet_place": "Create a quiet, regular study place to help you stay focused.",
                "early_prep": "Start your exam preparation early to avoid stress.",
                "cost_levels": "Costs depend on the certificate: Lower secondary < Intermediate < Abitur.",
                "funding_options": "Possible support: Education vouchers (Bildungsgutschein), BAföG (student funding), or scholarships.",
                "ask_agency_first": "Always ask your Jobcenter or Employment Agency about funding BEFORE you pay for anything yourself."
            },
            "links": {
                "ils_school": "ILS - Private distance-learning school with tutor support",
                "sgd_school": "SGD - Large correspondence school for various school certificates",
                "klett_academy": "Fernakademie Klett - Distance education provider with personal mentoring",
                "scholarships": "Overview of scholarships and financial support for school certificates",
                "comparison_portal": "Compare and read reviews of different distance-learning providers",
                "ba_funding": "Official information on financial support from the Employment Agency",
                "funding_search": "Search tool for funding programs, grants, and education support in Germany",
                "bafog_mv": "Information about BAföG student funding specifically for Mecklenburg-Vorpommern"
            },
            "steps": {
                "research_schools": "Research different distance schools and available certificates.",
                "choose_and_apply": "Choose a school that fits your needs and apply.",
                "create_study_plan": "Order your learning materials and create a weekly study plan.",
                "use_support_systems": "Actively use tutors, forums, and study groups provided by the school.",
                "register_exams": "Don't forget to register for the official final exams in time."
            }
        }
    }
}